<?php

// Тут ми можемо вказати статичні ідентифікатори відстеження конверсій гугл та фейсбук
// Вони будуть використовуватись ТІЛЬКИ ЯКЩО в цього відвідувача ідентифікатори
// Якщо дані не будуть вказано ні тут ні get параметрах, то трекінг коди не будуть завантажуватись на сторінці
$fbp = ''; // facebook ID '13100000000000'
$ggl = ''; // google analitics tag ID 'G-DMJV2XXXXXX'

// На який переіод ставимо кукіси з ggl та fbp які дістали з _GET
// Завдяки цьому ми можемо дозволити відвідувачу:
// гуляти сайтом (якщо коли сайт не одностранічний)
// він може чистити урл від get параметрів (мало лі що він собі придумає)
$srok = 30; // days

// Якщо після успішно поданої заявки потрібно кудись переадресовувати користувача
// Тоді тут потрібно вказати посилання 
// Якщо посилання має вести на цей же сайт, то можна вказати не через https://.... а так '/page.php'
// Якщо посилання НЕ вказане (false), тоді клієнт побачить модальне вікно з повідомленням про успіх
$successLink = '/success.php'; // /success.php

// Як ми отримуємо дані про IP
// Якщо хочеться використовувати В ПЕРШУ ЧЕРГУ локальні базі 
// і звертатись до API лише у випадку якщо локальні не дають однозначного результату
// Тоді треба другим параметром вказати 'combo'
// Якщо треба використовувати тільки локальні бази 'local'
$howIpData = 'api'; // api - якщо використовуємо лише API

// Визначаємо тип бази з яким працюємо
// mysql or sqlite
// Система автоматично  почне працювати з потрібним типом бази
// ! Connect налаштування вказуються в файлі db.php
$sql = 'sqlite';


// Далі по коду тут ніяких важливих налаштувань немає
// Але можливо, в випадку зміни шаблону (template) сайту
// доведеться налаштувати валідування та зберігання вхідних данних з форм
// В файлі form.php





mb_internal_encoding('UTF-8');
mb_language('uni');
//date_default_timezone_set('Europe/Kiev');

// Автоматичне завантаження класів
function __autoload_libraries($name)
    {
    $file = $_SERVER['DOCUMENT_ROOT'] . '/lib/' . $name . '.php';
    if (file_exists($file)) {
        require_once $file;
        return true;
        }
    return false;
    }
spl_autoload_register('__autoload_libraries');
// Ініціалізуємо доступ до бази
// В залежності від вмісту цього файлу - система автоматично може працювати як з MySQL так і з SQLite
// Логіка системи і запити до бази побудовані таким чином, що в них через ці переходи не треба буде нічого змінювати
require_once $_SERVER['DOCUMENT_ROOT'] . "/db.php";
core::$SQL = $sql;




// Якщо є GET параметри ggl та/або fbp 
if (!empty($_GET["ggl"])) {
    // Чистимо від сміття і перевіряємо на адекватність даних перш ніж зберігати їх до кукісів
    // Зберігаємо кукіси якщо вказано третій параметр
    $ggl = core::setTrackId($_GET["ggl"], $srok, 'ggl');
    }
if (!empty($_GET["fbp"])) {
    // Чистимо від сміття і перевіряємо на адекватність даних перш ніж зберігати їх до кукісів
    // Зберігаємо кукіси якщо вказано третій параметр
    $fbp = core::setTrackId($_GET["fbp"], $srok, 'fbp');
    }
// Чистимо від сміття і перевіряємо на адекватність даних що передано в куках
if (!empty($_COOKIE["ggl"])) {
    $ggl = core::setTrackId($_COOKIE["ggl"], $srok);
    }
if (!empty($_COOKIE["fbp"])) {
    $fbp = core::setTrackId($_COOKIE["fbp"], $srok);
    }



// Отримуємо максимально точний IP візитера
$ip = geo::getIP();

// На цьому етапі ми можемо перевірити, чи немає ip в якомусь нашому чорному списку
// Чи можливо це бот?
// Коротше ось тут можна (якщо треба) запустити процеси клоакінгу та блокувань




// Якщо це НЕ локальний мув, тоді шукаємо справжню інформацію по IP
if ($ip != '127.0.0.1') {
    // Підключаємо додаткові класи для роботи з IP локально
    require_once $_SERVER['DOCUMENT_ROOT'] . "/geo/SxGeo/SxGeo.php";
    // Отримуємо дані по IP
    // Зберігати усі дані по IP (провайдера, індекс etc) не проблема, але я вирішив ускладнити і виділяти лише місто та країну
    $ipInfo = geo::ipInfo($ip, $howIpData);
    $CountryByIP = $ipInfo['country'];
    $CityByIP = $ipInfo['city'];
    } else {

    // Для локальних мувів даємо заглушку
    $CountryByIP = 'aa';
    $CityByIP = 'misto';
    }




// Отримуємо домен на якому знаходимося
$host = core::getCurrentDomainByServerHttpHost();




// Якщо _POST не пустий, то наша логіка передбачає, що це вхід на AJAX форму
// В будь якому випадку, ніяких _POST на інших сторінках сайту не передбачено
if (!empty($_POST)) {
    require_once $_SERVER['DOCUMENT_ROOT'] . "/form.php";
    exit;
    }






